MKS_nozzles_3x4_array/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    // Domain dimensions
    xMin   -0.5;
    xMax   0.5;
    yMin   -0.4;
    yMax   0;
    zMin   0;
    zMax   2.4;

    // Cell divisions in each direction
    xCells  36;//18; //18 36;
    yCells  15;//7; //15 30;
    zCells  80;//40; //40 80;

convertToMeters 1;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $xCells
        $yCells
        $zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    filmWalls
    {
        type wall;
        faces
        (
            (0 3 2 1) //bottom
            (3 7 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (4 5 6 7)
            (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
